erp3l/src/Catalogs/ПараметрыОбесцененияВНАМСФО/ПараметрыОбесцененияВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыОбесцененияВНАМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоОбесценению</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоОбесценениюСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоОбесценениюСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоОбесценениюСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленногоОбесценения</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленногоОбесцененияСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленногоОбесцененияСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленногоОбесцененияСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДооценкаНаВсюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоОбесценению</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоОбесценениюСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоОбесценениюСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоОбесценениюСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбесценения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ПараметрыОбесцененияВНАМСФО/ManagerModule.bsl
Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетРасходовПоОбесценениюСубконто1");
	Субконто.Вставить(2, "СчетРасходовПоОбесценениюСубконто2");
	Субконто.Вставить(3, "СчетРасходовПоОбесценениюСубконто3");
	
	Результат.Вставить("СчетРасходовПоОбесценению", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетДоходовПоОбесценениюСубконто1");
	Субконто.Вставить(2, "СчетДоходовПоОбесценениюСубконто2");
	Субконто.Вставить(3, "СчетДоходовПоОбесценениюСубконто3");
	
	Результат.Вставить("СчетДоходовПоОбесценению", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетНакопленногоОбесцененияСубконто1");
	Субконто.Вставить(2, "СчетНакопленногоОбесцененияСубконто2");
	Субконто.Вставить(3, "СчетНакопленногоОбесцененияСубконто3");
	
	Результат.Вставить("СчетНакопленногоОбесценения", Субконто);
	
	Возврат Результат;
	
КонецФункции
